reference/reference_glossary.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet - Glossary</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-17 00:26:37 EDT"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="A glossary of terms used by pallet"/>
<meta name="keywords" content="pallet domain map glossary"/>
<link rel="stylesheet" type="text/css" href="doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>
<link rel="stylesheet" type="text/css" href="../doc.css" /><link rel="stylesheet" type="text/css" href="http://fonts.googleapis.com/css?family=Molengo"/>

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet - Glossary</h1>

<p>Pallet uses the following domain terms:
</p>
<dl>
<dt>crate</dt><dd>
A namespace containg crate functions
</dd>
<dt>action</dt><dd>
The basic unit of configuration supplied by pallet.
</dd>
<dt>action plan</dt><dd>
A sequence of actions that have been called by phase.
</dd>
<dt>environment</dt><dd>
A map that is used to pass in external data and configuration
together with the servers that are running for that into
pallet pallet.  Can be specified at various scopes.
</dd>
<dt>crate function</dt><dd>
A function taking a session and other arguments.  A crate
function can call other crate functions and actions.
</dd>
<dt>group</dt><dd>
A group of identically configured nodes, represented as a group-spec,
group-spec.
</dd>
<dt>group-name</dt><dd>
The name used to identify a group.
</dd>
<dt>group-spec</dt><dd>
A group of identically configured nodes, represented as a map
with :group-name, :count and server-spec keys.  The
group-name is used to link running nodes to their
configuration (via pallet.compute.Node/group-name)
</dd>
<dt>node</dt><dd>
A node in the compute service
</dd>
<dt>node-spec</dt><dd>
A specification for a node. The node-spec provides an image
hardware, location and network template for starting new
nodes.
</dd>
<dt>phase</dt><dd>
A function taking a session, and calling crate functions and actions
</dd>
<dt>parameters</dt><dd>
A map that is used to pass pass values between crates.  Can be
used on same node, or across nodes.
</dd>
<dt>server</dt><dd>
A map used to descibe the node, image, etc of a single node running
as part of a group. A server has the following
keys :group-name, :node, :node-id and server-spec keys.
</dd>
<dt>server-spec</dt><dd>
A specification for a server. This is a map of phases and a
default node-spec. A server-spec has the following keys
:phase, :packager and node-spec keys.
</dd>
<dt>session</dt><dd>
A map that is used to hold state and context information for the
duration of a lift or converge call
</dd>
</dl>


<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2011-06-17 00:26:37 EDT</p>
<p class="creator">HTML generated by org-mode 7.4 in emacs 24</p>
</div>
</div>
</body>
</html>
